BavinnK/STM32_F446RE_DRIVERS_V2.0/Core/DRIVERS_V2.0/SPI/SPI_POLLING.h
#ifndef SPI_POLLING_H
#define SPI_POLLING_H

#include "stdint.h"
#include "stm32f446xx.h"
#include "GPIO.h"

///////////////////////////////////////////////////////////////////////////////////////////////////
// ENUMS
///////////////////////////////////////////////////////////////////////////////////////////////////

typedef enum{
	BIT8_FORMAT_SPI=0,
	BIT16_FORMAT_SPI
}dff_spi;
typedef enum{
	MSB_FIRST_SPI=0,
	LSB_FIRST_SPI
}frame_spi;
typedef enum{
	CK0_IDLE_SPI=0,
	CK1_IDLE_SPI
}cpol_spi;
typedef enum{
	FIRST_CLK_SPI=0,
	SECOND_CLK_SPI
}cpha_spi;

///////////////////////////////////////////////////////////////////////////////////////////////////
// END ENUMS
///////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////////
// STRUCTS
///////////////////////////////////////////////////////////////////////////////////////////////////

typedef struct{
	dff_spi data_format;
	frame_spi frame_format;
	uint8_t prescaler;
	cpol_spi clock_polarity;
	cpha_spi clock_phase;
	uint8_t cs_pin;
	GPIO_TypeDef *cs_port;
}spi_config_t;

///////////////////////////////////////////////////////////////////////////////////////////////////
// END STRUCTS
///////////////////////////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////////////////////////
// FUNCTION PROTOTYPES
///////////////////////////////////////////////////////////////////////////////////////////////////

void SPIx_init(SPI_TypeDef *spi,spi_config_t *config);
uint8_t SPIx_transfer(SPI_TypeDef *spi,uint8_t data);
void SPIx_transmit(SPI_TypeDef *spi, uint8_t *buffer, uint32_t length);
void SPIx_receive(SPI_TypeDef *spi, uint8_t *buffer, uint32_t length);
void SPIx_CS_LOW(GPIO_TypeDef *port,uint8_t CS);
void SPIx_CS_HIGH(GPIO_TypeDef *port,uint8_t CS);

///////////////////////////////////////////////////////////////////////////////////////////////////
// END FUNCTION PROTOTYPES
///////////////////////////////////////////////////////////////////////////////////////////////////

#endif
